[
  {
    "name": "Comfort Supreme Bed",
    "image": "path/to/bed-image.jpg",
    "details": "Indulge in luxurious sleep comfort with our premium Comfort Supreme Bed. Crafted with the finest materials and expert craftsmanship, this bed is designed to provide you with restful nights and exquisite style. Its elegant design and ergonomic features ensure that you wake up rejuvenated and ready to take on the day.",
    "price": 1299.99,
    "availability": 10
  },
  {
    "name": "Luxury Lounge Sofa",
    "image": "path/to/sofa-image.jpg",
    "details": "Experience the epitome of luxury and relaxation with our exquisite Luxury Lounge Sofa. Its sumptuous cushions, premium upholstery, and meticulous craftsmanship create a haven of comfort and style in your living space. Whether you're hosting guests or unwinding after a long day, this sofa offers unparalleled comfort and timeless elegance.",
    "price": 1899.5,
    "availability": 5
  },
  {
    "name": "Elegant Bedside Table",
    "image": "path/to/bedside-table-image.jpg",
    "details": "Add a touch of timeless elegance to your bedroom with our Elegant Bedside Table. This beautifully crafted piece features a classic design, versatile storage options, and high-quality materials. Its refined aesthetics and functional features make it the perfect companion to your bed, enhancing both style and convenience in your space.",
    "price": 149.99,
    "availability": 20
  },
  {
    "name": "Modern Hospital Reception Table",
    "image": "path/to/reception-table-image.jpg",
    "details": "Create a welcoming and contemporary reception area with our Modern Hospital Reception Table. Its sleek design, durable construction, and thoughtful layout make it an ideal choice for healthcare settings. Whether it's for checking in patients or providing information, this table combines style and functionality to enhance any reception space.",
    "price": 499.0,
    "availability": 2
  },
  {
    "name": "Chic Dining Table",
    "image": "path/to/dining-table-image.jpg",
    "details": "Gather your loved ones around the Chic Dining Table for memorable meals and meaningful conversations. Its sophisticated design, sturdy build, and ample seating space make it a perfect addition to your dining area. Crafted for both style and durability, this table sets the stage for unforgettable dining experiences.",
    "price": 799.99,
    "availability": 8
  },
  {
    "name": "Premium Gaming Chair",
    "image": "path/to/gaming-chair-image.jpg",
    "details": "Elevate your gaming experience with the ergonomically designed Premium Gaming Chair. Engineered for comfort and support, this chair ensures hours of immersive gameplay without sacrificing style. With adjustable features, premium materials, and a sleek aesthetic, it's the ultimate companion for both casual and professional gamers.",
    "price": 299.99,
    "availability": 15
  },
  {
    "name": "Elegant Office Lounge Chair",
    "image": "path/to/office-lounge-chair-image.jpg",
    "details": "Transform your office into a comfortable haven with the Elegant Office Lounge Chair. Its sophisticated design, plush cushioning, and ergonomic features create a space where work meets relaxation. Whether it's for brainstorming sessions or moments of respite, this chair enhances your office ambiance and fosters productivity.",
    "price": 399.0,
    "availability": 6
  },
  {
    "name": "Mid-Century Styled Bed",
    "image": "path/to/mid-century-bed-image.jpg",
    "details": "Embrace the timeless charm of mid-century design with the Mid-Century Styled Bed. Inspired by the iconic aesthetic of the mid-20th century, this bed combines retro elegance with modern comfort. Crafted with attention to detail and quality, it transforms your bedroom into a stylish retreat where vintage meets contemporary.",
    "price": 999.0,
    "availability": 3
  }
]
